---
kind: enumMember
id: F:Autodesk.Revit.DB.PreviewFamilyVisibilityMode.Uncut
enum: Autodesk.Revit.DB.PreviewFamilyVisibilityMode
source: html/efc5a721-5885-f63e-64af-83e0c93e6c45.htm
---
# Autodesk.Revit.DB.PreviewFamilyVisibilityMode.Uncut

Element Visibility of a view is applied to show elements visible if instance is not cut.
 Note that this state is only available in certain views, such as floor plan and ceilings.